Repository: krishnaji-yedlapalli/flutter_end_to_end
Catalog: lib/l10n/app_*.arb
Languages: es, he, hi

source: Localization
es: Localización
he: לוקליזציה
hi: स्थानीयकरण

source: Light Theme
es: Tema ligero
he: נושא קליל

source: Dark Theme
es: Tema oscuro
he: ערכת נושא כהה

# simplifiedStrings
source: Simplified the below strings using Intl package :
es: Simplificó las siguientes cadenas usando el paquete Intl:
he: פשט את המיתרים באמצעות החבילה

source: Select Language :
es: Seleccione el idioma :
he: בחר שפה :

# overridingTheLanguage
source: Overriding the Language in a specific place/widget
es: Anular el idioma en un lugar/widget específico
he: עקיפה של השפה במקום/יישומון ספציפי

source: Select Override Language
es: Seleccionar idioma de anulación
he: בחר ביטול שפה

# passingDynamicValue
source: Passing dynamic value to a String
es: Pasar valor dinámico a una cadena
he: העברת ערך דינמי למחרוזת

# pluralOrSingular
source: Showing the plural or singular based on the count
es: Mostrando la plural o singular basada en el conc.t
he: הצגת רבים או יחיד על סמך הספירה

# selectMessageBasedOnString
source: Show the message based on the passed string using select
es: Muestre el mensaje según la cadena pasada usando select
he: הצג את ההודעה על סמך המחרוזת שעברה באמצעות select

# typeBasedOnCount
source: Showing the type based on the count
es: Mostrando el tipo según el recuento
he: מציג את הסוג על סמך הספירה

# escapeInterpolation
source: Escaping the Interpolation in a string
es: Escapar de la interpolación en una cadena
he: בריחה מהאינטרפולציה במחרוזת

# passingDynamicValueDes
source: Passing Hello and Brother as dynamic value to localized string, below was the output
es: Pasando Hola y Hermano como valor dinámico a una cadena localizada, a continuación se muestra el resultado
he: העברת Hello and Brother כערך דינמי למחרוזת מקומית, למטה הייתה הפלט

# pluralOrSingularDes
source: Showing the pluralizing the word, here based on the count pluralize will be displayed people/peoples..
es: Mostrando la pluralización de la palabra, aquí, según el recuento de pluralización, se mostrará personas/pueblos.
he: מראה בריבוי המילה, כאן בהתבסס על הספירה ריבוי יוצגו אנשים/אנשים..

# selectMessageBasedOnStringDes
source: Similar to Plural we can shown the message based on the passed value, below based on the noun gender will be shown
es: De manera similar a Plural, podemos mostrar el mensaje según el valor pasado; a continuación, se mostrará según el género del sustantivo.
he: בדומה לרבים אנו יכולים להציג את ההודעה על סמך הערך שעבר, להלן על סמך שם העצם מגדר יוצג

# escapeInterpolationDes
source: By default dart consider interpolation as a place holder, In below string we are escaping it using single quotation
es: De forma predeterminada, Dart considera la interpolación como un marcador de posición. En la siguiente cadena, la escapamos usando comillas simples.n
he: כברירת מחדל, יש לשקול את האינטרפולציה כמחזיק מקום, במחרוזת למטה אנו בורחים ממנה באמצעות ציטוט בודד

# representingCurrencies
source: Representing the Currencies with currency symbol based on the locale
es: Representar las monedas con el símbolo de moneda según la ubicación
he: ייצוג המטבעות עם סמל המטבע על סמך המקום

source: Compact :
es: Compacto :
he: קומפקטי:

source: Compact currency :
es: Moneda compacta:
he: מטבע קומפקטי:

source: Compact Simple currency :
es: Moneda simple compacta:
he: מטבע קומפקטי פשוט:

source: Compact Long :
es: Compacta larga:
he: קומפקטי ארוך:

source: Currency :
es: Divisa :
he: מטבע:

source: Decimal Percent :
es: Porcentaje decimal:
he: אחוז עשרוני:

# description
source: Des :
he: של ה

# greetings
source: Hello {firstName} {lastName}
es: Hola {firstName} {lastName}
he: שלום {firstName} {lastName}
hi: हैलो {firstName} {lastName}

# pluralMessage
source: There are total {peoplesCount, plural, =0{0 people} =1{1 person} =2{2 people} other{{count} peoples}} in den
es: hay totales {peoplesCount, plural, =0{0 gente} =1{1 persona} =2{2 gente} other{{count} pueblos}} in den
he: יש סך הכל {peoplesCount, plural, =0{0 אֲנָשִׁים} =1{1 אדם} =2{2 אֲנָשִׁים} other{{count} עמים}} במאורה
hi: कुल हैं {peoplesCount, plural, =0{0 people} =1{1 person} =2{2 people} other{{count} peoples}} मांद में

# pluralSampleOne
source: {count, plural, =0{ramesh} =1{raza} =2{krishna} few{few persons} many{many persons} other{{count} students}}
es: {count, plural, =0{ramesh} =1{raza} =2{krishna} few{Pocas personas} many{Muchas personas} other{{count} estudiantes}}
he: {count, plural, =0{sampleNameOne} =1{sampleNameTwo} =2{sampleNameThree} few{few persons} many{many persons} other{{count} students}}

# selectSample
source: Person is{gender, select, he{Male} she{Female} other{He/She not info}}
es: La persona es {gender, select, he{Masculina} she{Femenina} other{Él/Ella no tiene información}}
he: אדם הוא {gender, select, he{זָכָר} she{נְקֵבָה} other{הוא/היא אין מידע}}
hi: व्यक्ति है {gender, select, he{पुरुष} she{महिला} other{उसे कोई जानकारी नहीं है}}

# escapingTheInterpolation
source: Hello this is John carter '{is n''t}'
es: Hola, soy John Carter. '{is n''t}'
he: שלום זה גון קרטר '{is n''t}'
hi: नमस्ते, मैं जॉन कार्टर हूं '{is n''t}'

# amountWithCompact
source: Current Budget of application : {amount}
he: תקציב יישום נוכחי: {amount}

# amountWithCompactCurrency
source: Current Budget of application : {amount}
es: Presupuesto actual de aplicación : {amount}
he: תקציב יישום נוכחי: {amount}
hi: आवेदन का वर्तमान बजट: {amount}

# amountWithCompactSimpleCurrency
source: Current Budget of application : {amount}
es: Presupuesto actual de aplicación : {amount}
he: תקציב יישום נוכחי: {amount}
hi: आवेदन का वर्तमान बजट: {amount}

# amountWithCompactLong
source: Current Budget of application : {amount}
es: Presupuesto actual de aplicación : {amount}
he: תקציב יישום נוכחי: {amount}
hi: आवेदन का वर्तमान बजट: {amount}

# amountWithCurrency
source: Current Budget of application : {amount}
es: Presupuesto actual de aplicación : {amount}
he: תקציב יישום נוכחי: {amount}
hi: आवेदन का वर्तमान बजट: {amount}

# amountWithDecimalPercentPattern
source: Current Budget of application : {amount}
es: Presupuesto actual de aplicación : {amount}
he: תקציב יישום נוכחי: {amount}
hi: आवेदन का वर्तमान बजट: {amount}

source: Date Format
es: Formato de fecha
he: פורמט תאריך

# currentDate
source: Today Date : {date}
es: Fecha de hoy : {date}
he: תאריך היום : {date}
hi: आज की तारीख़ : {date}

# sampleText1
source: Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the '{industry''s}' standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book.
es: Lorem Ipsum es simplemente un texto de relleno de la industria de la impresión y la tipografía. Lorem Ipsum ha sido el texto de relleno estándar de la industria desde el siglo XVI, cuando un impresor desconocido tomó una galería de tipos y los mezcló para hacer un libro de muestra de tipos.
he: Lorem Ipsum הוא פשוט טקסט דמה של תעשיית הדפוס והקביעה. Lorem Ipsum היה טקסט הדמה הסטנדרטי של התעשייה מאז שנות ה-1500, כאשר מדפסת לא ידועה לקחה גלריה של סוג וערבכה אותה כדי ליצור ספר דגימות סוג.

# sampleText2
source: There are many variations of passages of Lorem Ipsum available, but the majority have suffered alteration in some form, by injected humour, or randomised words which don't look even slightly believable. If you are going to use a passage of Lorem Ipsum, you need to be sure there isn't anything embarrassing hidden in the middle of text. All the Lorem Ipsum generators on the Internet tend to repeat predefined chunks as necessary
es: Hay muchas variaciones de pasajes de Lorem Ipsum disponibles, pero la mayoría ha sufrido alguna alteración, mediante humor inyectado o palabras aleatorias que no parecen ni un poco creíbles. Si vas a utilizar un pasaje de Lorem Ipsum, debes asegurarte de que no haya nada vergonzoso escondido en medio del texto. Todos los generadores de Lorem Ipsum en Internet tienden a repetir fragmentos predefinidos según sea necesario.
he: הוא פשוט טקסט גולמי של תעשיית ההדפסה וההקלדה. Lorem Ipsum היה טקסט סטנדרטי עוד במאה ה-16, כאשר הדפסה לא ידועה לקחה מגש של דפוס ועירבלה אותו כדי ליצור סוג של ספר דגימה. ספר זה שרד לא רק חמש מאות שנים אלא גם את הקפיצה לתוך ההדפסה האלקטרונית, ונותר כמו שהוא ביסודו. ספר זה הפך פופולרי יותר בשנות ה-60

# sampleText3
source: It uses a dictionary of over 200 Latin words, combined with a handful of model sentence structures, to generate Lorem Ipsum which looks reasonable
es: Utiliza un diccionario de más de 200 palabras latinas, combinado con un puñado de estructuras de oraciones modelo, para generar Lorem Ipsum, que parece razonable.
he: וחלקים מתוך הספרות הלטינית הקלאסית מאז 45 לפני הספירה. מה שהופך אותו לעתיק מעל 2000 שנה. ריצ'רד מקלינטוק, פרופסור לטיני בקול של המפדן-סידני בורג'יניה, חיפש את אחת המילים המעורפלות ביותר בלטינית - consectetur - מתוך פסקאות של Lorem Ipsum ודרך ציטוטים של המילה מתוך הספרות הקלאסית, הוא גילה מקור בלתי ניתן לערעור.

# countDetails
source: {count, plural, =0{0 persons} =1{1 persons} other{{count} peoples}}
es: {count, plural, =0{0 personas} =1{1 personas} other{{count} pueblos}}
